app/controllers/cars_controller.rb

INSERT INTO "cars" ("name", "year_fac", "color", "created_at", "updated_at", "engine") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Fiat Uno"], ["year_fac", Sun, 20 Nov 2016], ["color", "Marrom"], ["created_at", 2016-11-20 14:29:50 UTC], ["updated_at", 2016-11-20 14:29:50 UTC], ["engine", "1.0"]]
---
  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save

UPDATE "cars" SET "engine" = ?, "year_fac" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["engine", "2.0"], ["year_fac", Sun, 20 Nov 2016], ["updated_at", 2016-11-20 14:31:09 UTC], ["id", 5]]
---
  def update
    respond_to do |format|
      if @car.update(car_params)